var D = require('drizzlejs');

var messages = {
    1: '操作失败，您没有此权限',
    2: '操作失败，请稍后重试',
    3: '操作失败，请稍后重试',
    4: '操作超时，请稍后重试',
    900000: '验证失败，请重试',
    900001: '属性值必填',
    900002: '格式错误',
    900003: '文件大小超出限制',
    900004: '文件类型不支持',
    900005: '该资源已不存在',
    900008: '您好，您的操作过于频繁，请稍后再试',
    900009: '您好，您今日操作过于频繁，请明日再来吧',
    910000: '操作失败，数据已被关联，无法删除',
    910001: '数据类型错误',
    910002: '长度不匹配',
    910003: '必填',
    910004: '邮箱不合法',
    910005: '手机号码不合法',
    910006: '身份证不合法',
    910007: '编码不合法',
    910008: '序号不合法'
};

var ms = D.assign({}, messages);

exports.get = function(key) {
    if (!ms[key]) throw new Error('Key [' + key + '] is not defined');
    return ms[key];
};
